Router>
Router>conf t
            ^
% Invalid input detected at '^' marker.
	
Router>en
Router#hostname R3
                ^
% Invalid input detected at '^' marker.
	
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R3
R3(config)#
R3(config)#
R3(config)#
R3(config)#int G0/1
R3(config-if)#ip addr 192.168.1.3 255.255.255.0
R3(config-if)#no shut

R3(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

R3(config-if)#
R3(config-if)#
R3(config-if)#int S0/1/1
R3(config-if)#ip addr 10.2.2.1 255.255.255.252
R3(config-if)#no shut

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
R3(config-if)#
R3(config-if)#
R3(config-if)#

R3>
R3>
R3>en
R3#
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#
R3(config)#
R3(config)#
R3(config)#router rip
R3(config-router)#version 2
R3(config-router)#network 192.168.1.0
R3(config-router)#network 10.2.2.0
R3(config-router)#no auto-summ
R3(config-router)#no auto-summary 
R3(config-router)#no auto-summary 
R3(config-router)#
R3>
R3>en
R3#int g0/1
       ^
% Invalid input detected at '^' marker.
	
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#standby version 2
            ^
% Invalid input detected at '^' marker.
	
R3(config)#int g0/1
R3(config-if)#standby version 2
R3(config-if)#standby 1 ip 192.168.1.254
R3(config-if)#
%HSRP-6-STATECHANGE: GigabitEthernet0/1 Grp 1 state Init -> Init

R3(config-if)#show standby
                ^
% Invalid input detected at '^' marker.
	
R3(config-if)#co
%HSRP-6-STATECHANGE: GigabitEthernet0/1 Grp 1 state Speak -> Standbend
R3#
%SYS-5-CONFIG_I: Configured from console by console

R3#
R3#
R3#show standby
GigabitEthernet0/1 - Group 1 (version 2)
  State is Standby
    5 state changes, last state change 00:59:29
  Virtual IP address is 192.168.1.254
  Active virtual MAC address is 0000.0C9F.F001
    Local virtual MAC address is 0000.0C9F.F001 (v2 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 2.598 secs
  Preemption disabled
  Active router is 192.168.1.1
  Standby router is local
  Priority 100 (default 100)
  Group name is hsrp-Gig0/1-1 (default)
R3#
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int g0/1
R3(config-if)#standby 1 preempt
R3(config-if)#
 %HSRP-6-STATECHANGE: GigabitEthernet0/1 Grp 1 state Standby -> Active

R3(config-if)#do show stand
GigabitEthernet0/1 - Group 1 (version 2)
  State is Active
    9 state changes, last state change 01:17:48
  Virtual IP address is 192.168.1.254
  Active virtual MAC address is 0000.0C9F.F001
    Local virtual MAC address is 0000.0C9F.F001 (v2 default)
  Hello time 3 sec, hold time 10 sec
    Next hello sent in 0.771 secs
  Preemption enabled
  Active router is local
  Standby router is 192.168.1.3, priority 150 (expires in 4 sec)
  Priority 200 (configured 200)
  Group name is hsrp-Gig0/1-1 (default)
R3(config-if)#